ash/interfaces/classes_qmmmeda.dot
digraph "classes_qmmmeda" {
rankdir=LR
ratio=0.5625
margin=0.1
charset="utf-8"
"ash.interfaces.QMMMEDA.QMMMConfig" [color="black", fontcolor="black", label=<{QMMMConfig|charge : int<br ALIGN="LEFT"/>eda_atm : List[int]<br ALIGN="LEFT"/>eda_charge : List[int]<br ALIGN="LEFT"/>eda_mult : List[int]<br ALIGN="LEFT"/>forcefield : Optional[str]<br ALIGN="LEFT"/>mult : int<br ALIGN="LEFT"/>numcores : int<br ALIGN="LEFT"/>pdbfile : Optional[str]<br ALIGN="LEFT"/>qm_atoms : List[int]<br ALIGN="LEFT"/>qm_theory_full : XEDATheory<br ALIGN="LEFT"/>xmlfiles : Optional[List[str]]<br ALIGN="LEFT"/>xyzfile : Optional[str]<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"ash.interfaces.QMMMEDA.QMMMTheory_EDA" [color="black", fontcolor="black", label=<{QMMMTheory_EDA|MMenergy : int<br ALIGN="LEFT"/>MMgradient<br ALIGN="LEFT"/>PCgradient : ndarray<br ALIGN="LEFT"/>QM_MM_energy<br ALIGN="LEFT"/>QM_MM_gradient<br ALIGN="LEFT"/>QMenergy : float<br ALIGN="LEFT"/>QMgradient : ndarray<br ALIGN="LEFT"/>QMgradient_wo_linkatoms : ndarray<br ALIGN="LEFT"/>do_qm : bool<br ALIGN="LEFT"/>extforce_energy<br ALIGN="LEFT"/>linkatoms : bool<br ALIGN="LEFT"/>pointchargecoords : ndarray<br ALIGN="LEFT"/>qm_coords : ndarray<br ALIGN="LEFT"/>runcalls<br ALIGN="LEFT"/>truncPC_E_correction<br ALIGN="LEFT"/>|elstat_run( ..., charge, mult)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"ash.interfaces.QMMMEDA.QMMM_EDA" [color="black", fontcolor="black", label=<{QMMM_EDA|config<br ALIGN="LEFT"/>energy_monomer1 : ASH_Results<br ALIGN="LEFT"/>energy_monomer2 : ASH_Results<br ALIGN="LEFT"/>energy_sup : ASH_Results<br ALIGN="LEFT"/>fragment1 : Fragment<br ALIGN="LEFT"/>fragment2 : Fragment<br ALIGN="LEFT"/>full_fragment : Fragment<br ALIGN="LEFT"/>is_fragment1_mm : bool<br ALIGN="LEFT"/>is_fragment2_mm : bool<br ALIGN="LEFT"/>mm_elec_interaction<br ALIGN="LEFT"/>mm_novdw1 : ASH_Results<br ALIGN="LEFT"/>mm_novdw2 : ASH_Results<br ALIGN="LEFT"/>mm_novdw_full : ASH_Results<br ALIGN="LEFT"/>mm_theory1 : NoneType, OpenMMTheory<br ALIGN="LEFT"/>mm_theory2 : NoneType, OpenMMTheory<br ALIGN="LEFT"/>mm_theory_full : OpenMMTheory<br ALIGN="LEFT"/>mm_without_nonbonded1 : ASH_Results<br ALIGN="LEFT"/>mm_without_nonbonded2 : ASH_Results<br ALIGN="LEFT"/>mm_without_nonbonded_full : ASH_Results<br ALIGN="LEFT"/>pdbfile1 : str<br ALIGN="LEFT"/>pdbfile2 : str<br ALIGN="LEFT"/>qm_atoms1 : list<br ALIGN="LEFT"/>qm_atoms2 : list<br ALIGN="LEFT"/>qm_theory1<br ALIGN="LEFT"/>qm_theory2<br ALIGN="LEFT"/>qmmm_theory1<br ALIGN="LEFT"/>qmmm_theory2<br ALIGN="LEFT"/>qmmm_theory_full<br ALIGN="LEFT"/>vdw_interaction<br ALIGN="LEFT"/>|<I>bsse_mono_cal</I>()<br ALIGN="LEFT"/><I>cal_qmmm_elec</I>()<br ALIGN="LEFT"/>initialize_fragment()<br ALIGN="LEFT"/>run()<br ALIGN="LEFT"/><I>run_eda</I>()<br ALIGN="LEFT"/>split_fragment(pdbfile, split_indices: List[int])<br ALIGN="LEFT"/>split_qmatms()<br ALIGN="LEFT"/>validate_config()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"ash.interfaces.QMMMEDA.XEDA_EB" [color="black", fontcolor="black", label=<{XEDA_EB|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"ash.interfaces.QMMMEDA.QMMMTheory_EDA" -> "ash.interfaces.QMMMEDA.QMMM_EDA" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="qmmm_theory_full", style="solid"];
"ash.interfaces.QMMMEDA.QMMMTheory_EDA" -> "ash.interfaces.QMMMEDA.QMMM_EDA" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="qmmm_theory1", style="solid"];
"ash.interfaces.QMMMEDA.QMMMTheory_EDA" -> "ash.interfaces.QMMMEDA.QMMM_EDA" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="qmmm_theory2", style="solid"];
"ash.interfaces.QMMMEDA.QMMMConfig" -> "ash.interfaces.QMMMEDA.QMMM_EDA" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="config", style="solid"];
}
